<template lang="pug">
.faq
  h2.header {{$t('ui.menus.faq')}}
  v-ons-card
    .title Q.使い方がわかりません。
    .answer
      | A.
      | 初期状態ではなにも表示されません。種別をオンにしたモンスターを対象に表示された名称をオンにすると下にモンスターの詳細が表示されます。まずはいろいろオン/オフしてみてください。
  v-ons-card
    .title Q.名前や種別の項目が消えてしまいました。
    .answer
      | A.
      | おそらく項目が折りたたまれた状態になってないでしょうか？その場合は「種別」や「名称」をタップしてみると項目が表示してください。
  v-ons-card
    .title Q.キーワードの使い方がわかりません
    .answer
      | A.
      | キーワードは絞り込みのためのものです。まずは全て表示状態にして何か入力してみてください。また、AND検索とOR検索にも対応してます。ANDの場合は半角スペースか半角スペースに囲まれたAND（半角）、OR検索は半角スペースに囲まれたORを入力してください。
      br
      | また、検索だけをしたい場合は種別、名称ともに全てオン状態にしてキーワードを入力すると使いやすいと思います。その場合、種別や名称を折りたたむことでより見やすくなります。
      br
      | ひらがなとカタカナは区別されません。また、名称だけでなく「滅尽龍」などの通称もキーワードの対象です。
  v-ons-card
    .title Q.データが間違っています。
    .answer
      | A.
      | メニューの問題報告から報告いただけると助かります。
  v-ons-card
    .title Q.データの参照元はどこですか？
    .answer
      | A.
      | ゲーム内のモンスター図鑑を参照しています。一部部位の表記のみ若干の変更をしています。
  v-ons-card
    .title Q.固まったり、なんか上手く動きません。
    .answer
      | A.
      | 以下の点を確認してください
      ul
        li Web-view(Twitterやチャットツールなどから直接見れる表示)ではなくブラウザで開いている
        li ブラウザを再読み込み（リロード）した
      | 以上を試してみて解消されない場合は、問題報告メニューから報告いただけると助かります。
  v-ons-card
    .title Q.改善点の提案があります。
    .answer
      | A.
      | 問題報告からご意見お待ちしております。ただし、確実にご要望に応えるお約束はしかねます。
  v-ons-card
    .title Q.不具合の報告をしたり、改善点の報告をしたのに修正されない。
    .answer
      | A.
      | なんらかの理由に修正できない、もしくはしないこともあります。ご了承ください。
</template>

<script>
export default {
  name: 'faq',
}
</script>

<style lang="stylus" scoped>
.header
  text-align: center
</style>
